### Sidebar: Grouping
page 169

In [4]:
import pandas as pd
from pandas import DataFrame, Series

In [7]:
df = DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 
                 'retail_price':1000, 'sales':100, 'department':'electronics'},
                {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000, 'department':'books'},
                {'product_id':97, 'name':'Pandas Workout','wholesale_price': 35,
                'retail_price':75, 'sales':500, 'department':'books'},
                {'product_id':15, 'name':'banana',
                'wholesale_price': 0.5,
                'retail_price':1, 'sales':200,
                'department':'food'},
                {'product_id':87, 'name':'sandwich',
                'wholesale_price': 3,
                'retail_price':5, 'sales':300,
                'department': 'food'},
                ])

In [8]:
df

,product_id,name,wholesale_price,retail_price,sales,department
0,23,computer,500.0,1000,100,electronics
1,96,Python Workout,35.0,75,1000,books
2,97,Pandas Workout,35.0,75,500,books
3,15,banana,0.5,1,200,food
4,87,sandwich,3.0,5,300,food

In [9]:
# number of products sold in a store
df.count()

product_id         5
name               5
wholesale_price    5
retail_price       5
sales              5
department         5
dtype: int64

In [11]:
df.groupby('department').count()

             product_id  name  wholesale_price  retail_price  sales
department
books                 2     2                2             2      2
electronics           1     1                1             1      1
food                  2     2                2             2      2

In [12]:
df.groupby('department').count()['product_id']

department
books          2
electronics    1
food           2
Name: product_id, dtype: int64

In [13]:
df.groupby('department')['product_id'].count()

department
books          2
electronics    1
food           2
Name: product_id, dtype: int64

In [14]:
df.groupby('department')['retail_price'].mean()

department
books            75.0
electronics    1000.0
food              3.0
Name: retail_price, dtype: float64

In [15]:
df.groupby('department')['retail_price'].agg(['mean', 'std'])

               mean       std
department
books          75.0  0.000000
electronics  1000.0       NaN
food            3.0  2.828427

In [18]:
df.groupby('department').agg(mean_price=('retail_price','mean'),
    std_price=('retail_price','std'),
    max_sales=('sales', 'max')
                            )

             mean_price  std_price  max_sales
department
books              75.0   0.000000       1000
electronics      1000.0        NaN        100
food                3.0   2.828427        300

In [19]:
df.groupby('department', sort=False)['retail_price'].agg(['mean', 'std'])

               mean       std
department
electronics  1000.0       NaN
books          75.0  0.000000
food            3.0  2.828427

In [20]:
df.groupby('department')['retail_price'].agg(['mean', 'std'])

               mean       std
department
books          75.0  0.000000
electronics  1000.0       NaN
food            3.0  2.828427

# Ex 30 - Taxi ride comparison